In [94]:
# import libraries

import numpy as np
import pandas as pd

## Arithmetic and allignment

In [96]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=["a", "c", "e", "f", "g"])

In [97]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [98]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [99]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [106]:
3 + np.nan

nan

In [102]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),index=["Utah", "Ohio", "Texas", "Oregon"])

In [103]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [104]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [105]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [107]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
 .....: columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
 .....: columns=list("abcde"))

In [108]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [109]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [110]:
df2['b'][1] = np.nan

In [111]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [112]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [113]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [114]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [115]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

## Operation between Dataframe and Series

In [116]:
arr = np.arange(12.).reshape(3,4)
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [117]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [118]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
 .....: columns=list("bde"),
 .....: index=["Utah", "Ohio", "Texas", "Oregon"])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [119]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [120]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [121]:
series2 = pd.Series(np.arange(3.), index=['b','e','f'])
series2

b    0.0
e    1.0
f    2.0
dtype: float64

In [122]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

## Function Application and Mapping

In [123]:
frame = pd.DataFrame(np.random.standard_normal((4,3)), 
                    index = ['Utah', 'Ohio','Texas','Oregon'], 
                    columns=list('bde'))
frame

               b         d         e
Utah    1.708582 -0.550495  0.034832
Ohio   -2.087336 -0.649737  0.631452
Texas  -0.331430  0.826879 -1.211369
Oregon -0.358789 -1.272019  0.545537

In [124]:
np.abs(frame)

               b         d         e
Utah    1.708582  0.550495  0.034832
Ohio    2.087336  0.649737  0.631452
Texas   0.331430  0.826879  1.211369
Oregon  0.358789  1.272019  0.545537

In [125]:
# apply method 

def f(x):
    return x.max() - x.min()

frame.apply(f)

b    3.795918
d    2.098899
e    1.842820
dtype: float64

In [127]:
frame.apply(f, axis='columns') # Columns

Utah      2.259078
Ohio      2.718788
Texas     2.038248
Oregon    1.817556
dtype: float64

In [130]:
def f1(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [131]:
frame.apply(f1)

            b         d         e
min -2.087336 -1.272019 -1.211369
max  1.708582  0.826879  0.631452

In [132]:
def f2(x):
    return f"{x:.2f}"

In [134]:
frame.applymap(f2) #applymap

            b      d      e
Utah     1.71  -0.55   0.03
Ohio    -2.09  -0.65   0.63
Texas   -0.33   0.83  -1.21
Oregon  -0.36  -1.27   0.55

## Sorting and Ranking

In [135]:
obj = pd.Series(np.arange(4), index=list('dabc'))
obj

d    0
a    1
b    2
c    3
dtype: int32

In [136]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [137]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int32

In [138]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
 .....: index=["three", "one"],
 .....: columns=["d", "a", "b", "c"])

In [139]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [140]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [142]:
frame.sort_values('a', ascending=False)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [143]:
# rank - equal values are assigned a rank that is the average of the ranks of those values.
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

## Axis index with duplicate labels

In [144]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [145]:
obj['a']

a    0
a    1
dtype: int32

In [146]:
obj.index.is_unique

False

In [147]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
 .....: index=["a", "a", "b", "b", "c"])
df

          0         1         2
a -0.878839  0.248456 -0.373892
a -1.155845 -1.352144 -0.633798
b  0.415320 -0.065567 -0.120506
b  0.367084 -0.559752 -0.311005
c -0.758136 -1.000439  1.197854

In [149]:
df.loc['a']

          0         1         2
a -0.878839  0.248456 -0.373892
a -1.155845 -1.352144 -0.633798

# Summarizing and Computing Desciptive Statistics

In [150]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
 .....: [np.nan, np.nan], [0.75, -1.3]],
 .....: index=["a", "b", "c", "d"],
 .....: columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [151]:
df.sum() #ignoring nans

one    9.25
two   -5.80
dtype: float64

In [152]:
df.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [154]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [156]:
df.mean(axis =1) # mean require 1 value

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [157]:
df.mean(axis = 'columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [158]:
df.idxmax()

one    b
two    d
dtype: object

In [159]:
df.idxmin()

one    d
two    b
dtype: object

In [163]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [164]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [165]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## Unique Values, Value Counts and Memberships

In [166]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [167]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [169]:
obj.value_counts().sort_index()

a    3
b    2
c    3
d    1
Name: count, dtype: int64

In [170]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
 .....: "Qu2": [2, 3, 1, 2, 3],
 .....: "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [171]:
data.Qu1.value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [172]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [173]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64